CSI API ETABS v1
cAnalyze.RunAnalysis Method
 Runs the analysis.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int RunAnalysis()
Function RunAnalysis As Integer
Dim instance As cAnalyze
Dim returnValue As Integer
returnValue = instance.RunAnalysis()
int RunAnalysis()
abstract RunAnalysis : unit -> int
Return Value
Type: Int32
Returns zero if the analysis model is successfully run; otherwise it returns a nonzero value.
Remarks
The analysis model is automatically created as part of this function.
IMPORTANT NOTE: Your model must have a file path defined before running the analysis. If the model is opened from an existing file, a file path is defined. If the model is created from scratch, the File.Save function must be called with a file name before running the analysis. Saving the file creates the file path.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace